{
    "authors": [
        "Joyce Lim",
        "Senior Correspondent"
    ],
    "date_download": "2021-10-18 20:00:49",
    "date_modify": null,
    "date_publish": "2021-09-27 00:00:00",
    "description": "Firm said users here will no longer be allowed to buy, trade crypto on its main platform next month. . Read more at straitstimes.com.",
    "filename": "https%3A%2F%2Fwww.straitstimes.com%2Fbusiness%2Fcompanies-markets%2Fbinancecom-users-in-singapore-given-one-month-to-withdraw-assets-redeem.json",
    "image_url": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/09/27/mi_binance_270921.jpg?itok=OvuqmFJ6",
    "language": "en",
    "localpath": null,
    "maintext": "SINGAPORE - Binance.com users in Singapore have been given one month to withdraw their fiat assets and redeem their tokens as the platform operator seeks to comply with a Monetary Authority of Singapore (MAS) directive.\nBinance - the world’s largest cryptocurrency exchange by trading volume - said on Monday (Sept 27) that users in the Republic would no longer be allowed to buy and trade cryptocurrencies on its main platform next month.\nOn Sept 2, Binance was placed on MAS’ Investor Alert List and ordered to cease providing payment services that are regulated under the Payment Services Act to Singapore residents.\nIt was also told to cease soliciting such business from Singapore residents.\nIn an announcement on its website on Monday (Sept 27) afternoon, Binance said: “Users in Singapore will not be able to access certain functions on Binance.com including fiat deposit services, spot trading of cryptocurrencies, the purchase of cryptocurrencies through fiat channels and liquid swap (“Regulated Payments Services”).”\n“As the market leader, Binance constantly evaluates its product and service offerings. We will be restricting Singapore users in respect of the Regulated Payments Services in line with our commitment to compliance.”\nUsers in Singapore are advised to cease all related trades, withdraw fiat assets and redeem tokens by noon on Oct 26, to avoid potential trading disputes.\nFiat assets are fiat currencies that users need to deposit into their Binance accounts first before they can use them to make the cryptocurrency purchases.\nIn response to media queries earlier, MAS said it has reviewed Binance.com’s operations and is of the view that Binance “may be in breach of the Payment Services Act for carrying on the business of providing payment services to, and soliciting such business from Singapore residents without an appropriate licence”.\nIn response to The Straits Times queries, a Binance spokesman said the Binance.com app has already been removed from the Singapore iOS and Google Play stores. Users here will not be able to download the app or app updates.\nShe added that new users are required to complete an intermediate verification form to access the platform’s products and services.\nThat includes keying in the residential country of the user.\nResponding to the Binance announcement, a user who wanted to be known as only Mr W. J. Teo, 29, said: “I will just move my assets to another exchange and there are many options available like KuCoin and Coinhako. I may incur some coin transfer fees but it won’t cost much.”\nMr Teo, who had been trading on Binance.com for the past three years, said the platform offers “one of the best exchange trading fees”.\nHe has no plans to open an account with its local arm Binance.sg as “it does not have exposure to that many coins as the main platform”.\nAnother user, Ms Serene Chan, said she withdrew all her assets in June after she read about how the authorities worldwide were clamping down on Binance’s operations.\nFounded by Chinese-Canadian Zhao Changpeng in 2017, Binance, which does not have a physical headquarters, has come under intense scrutiny from regulators, including in Malaysia, Britain, the United States, Italy and Thailand.\nIts British arm, Binance Markets, was in June banned from doing regulated business in the country over concerns that it was not doing enough to prevent money laundering and other financial crimes on its platform.",
    "nlp": [
        "users",
        "withdraw",
        "month",
        "regulated",
        "trading",
        "payment",
        "singapore",
        "platform",
        "assets",
        "services",
        "binance",
        "given",
        "tokens",
        "redeem",
        "binancecom",
        "fiat"
    ],
    "source_domain": "www.straitstimes.com",
    "summary": "SINGAPORE - Binance.com users in Singapore have been given one month to withdraw their fiat assets and redeem their tokens as the platform operator seeks to comply with a Monetary Authority of Singapore (MAS) directive.\nOn Sept 2, Binance was placed on MAS’ Investor Alert List and ordered to cease providing payment services that are regulated under the Payment Services Act to Singapore residents.\nWe will be restricting Singapore users in respect of the Regulated Payments Services in line with our commitment to compliance.”Users in Singapore are advised to cease all related trades, withdraw fiat assets and redeem tokens by noon on Oct 26, to avoid potential trading disputes.\nFiat assets are fiat currencies that users need to deposit into their Binance accounts first before they can use them to make the cryptocurrency purchases.\nShe added that new users are required to complete an intermediate verification form to access the platform’s products and services.",
    "text": null,
    "title": "Binance.com users in Singapore given one month to withdraw assets, redeem tokens",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.straitstimes.com/business/companies-markets/binancecom-users-in-singapore-given-one-month-to-withdraw-assets-redeem"
}