{
    "authors": [],
    "date_download": "2021-10-18 20:00:49",
    "date_modify": null,
    "date_publish": "2021-10-15 11:05:09",
    "description": "At the Sub0 Conference representatives of Parity Technologies, DOT founders Gavin Wood and Robert Habermeier, confirmed that Polkadot is now ready to",
    "filename": "https%3A%2F%2Fwww.fxstreet.com%2Fcryptocurrencies%2Fnews%2Fbinance-support-for-polkadot-parachain-auctions-could-send-dot-to-new-all-time-high-202110151105.json",
    "image_url": "https://editorial.fxstreet.com/images/Markets/Currencies/Cryptocurrencies/Polkadot/polkadot-150x150logo-637399979978734311_Large.png",
    "language": "en",
    "localpath": null,
    "maintext": "Polkadot development activity has increased consistently.\nParachain launch finalized, largest cryptocurrency exchange Binance announces support for DOT auctions.\nDOT price has posted over 16% gains since the announcement of the Parachain launch.\nAt the Sub0 Conference representatives of Parity Technologies, DOT founders Gavin Wood and Robert Habermeier, confirmed that Polkadot is now ready to implement parachains, auctions and crowd loans on its blockchain network.\nParachain launch confirmed, and DOT price prepares to climb higher\nPolkadot’s leadership team has laid out a schedule for Parachain actions, starting November 11. The project that was started five years ago is now nearing completion. The unique layer-1 blockchain solution tethered to the relay chain is set to boost the capabilities of decentralized applications.\nFive Polkadot Parachain auctions are expected to launch every week until the final auction on December 9. Binance, the largest cryptocurrency exchange, has announced its support for Polkadot Parachain slot auctions.\nKusama, a testnet platform for Polkadot blockchain, has successfully implemented 11 Parachain auctions, preparing the blockchain network for the upcoming launches.\nPeter Mauric, head of public affairs at Parity Technologies, was quoted,\nWhile there were a few bits of expected chaos along the way, the experience over the past few months deploying parachains on Kusama have given us confidence that they are ready for prime time on Polkadot.\nParachains are the core of the developments in the Polkadot ecosystem: scalability, customization and the decentralized infrastructure of the blockchain rely on them.\nSince the announcement of the launch, DOT price has posted over 16% gains.\nCryptocurrency analyst @rektcapital expects DOT price to continue its uptrend\n$DOT / USDT - #DOT #DOTUSDT #Polkadot\nDOT has broken out from its red-red range\nNow DOT is going to try to turn the red Range High into support in an effort confirm trend continuation#Crypto https://t.co/yJQfUVx8N7 pic.twitter.com/8jBnkKHeuu — Rekt Capital (@rektcapital) October 14, 2021\nPseudonymous cryptocurrency trader @DonnieBigBags commented on Polkadot’s ecosystem development and years in the making of Parachains. He tweeted:",
    "nlp": [
        "loading",
        "robot",
        "policy",
        "supports",
        "happenplease",
        "javascript",
        "service",
        "terms",
        "sure",
        "review",
        "information"
    ],
    "source_domain": "www.fxstreet.com",
    "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.",
    "text": null,
    "title": "Binance support for Polkadot parachain auctions could send DOT to new all-time high",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.fxstreet.com/cryptocurrencies/news/binance-support-for-polkadot-parachain-auctions-could-send-dot-to-new-all-time-high-202110151105"
}