{
    "authors": [
        "Kathryn Hauer",
        "Cfp"
    ],
    "date_download": "2021-10-18 15:37:15",
    "date_modify": null,
    "date_publish": "2021-10-15 13:14:00",
    "description": "Investing in crypto? FTX (formerly Blockfolio) can manage all of then on your phone, offering free price alerts and no-fee trading.",
    "filename": "https%3A%2F%2Fwww.benzinga.com%2Fmoney%2Fftx-review%2F.json",
    "image_url": "https://cdnwp-s3.benzinga.com/wp-content/uploads/2021/07/27182516/FTX.png",
    "language": "en",
    "localpath": null,
    "maintext": "Blockfolio is now FTX!\nYour success as a crypto trader depends on knowledge and agility. The best crypto trackers aim to deliver both. Cryptocurrency traders use a crypto tracker like FTX to check the price, quantities and trends of the cryptocurrency they own or that they might want to buy. FTX offers tracking and news information to increase your trading smarts and speed-of-light technology to augment your trading activity.\nFTX is a top cryptocurrency tracking app that supports the widest variation of cryptocurrencies you can acquire — over 10,000 types. The tracking app is free. FTX also supports no-fee trading in its app while continuing to welcome tracking subscribers who use other trading exchanges.\nWith FTX on your phone, you can view and assess all your crypto entries, no matter how common or rare. FTX competitors offer a fraction of types of currencies. A FTX account also gives you access to up-to-the-second news updates — instant alerts on any mic drop that could affect your crypto trades.\nIf you take a step beyond FTX’s precision tracker, you can buy and sell crypto with no fees in addition to following it. FTX’s unique trading incentive lets you in for a lottery-style payout of free coin when you make any trade over $10.\nAny crypto tracker you sign on to is run by a genius, but FTX’s resident genius, Sam Bankman-Fried, has a name that says money and a heart that says, “I care.” If you do any environmental, social and corporate governance (ESG) investing, you’ll want to support a crypto tracker run by someone who out-ESG the ESGs.\nIn response to a recent FTX hack, Bankman-Fried avowed that, “No members of the FTX team wanted this to happen. But we are all responsible for our product and will be doing what we can to fix this. I’ll also be donating to the ACLU today.” If you base any of your app choices on moral imperatives, FTX could be a choice.\nCryptocurrencies can make you money, but they can also leave you vulnerable to fraud. Using FTX to track even the smallest amount of obscure coin keeps you in the know. You can’t fight what you don’t see.\nIn addition to hacks that rob you or insult you, popular ransom hacks might try to blackmail you. The better you keep track of what you own, the more easily you can report, stop and counterattack. When you buy a new offering of a cryptocurrency, your FTX will track it for you. It’s like being granted a super-power.\nThe better the tracking, the better you can see if you are getting ripped off. FTX leadership has a refreshing attitude toward the nonregulated nature of crypto (let’s face it, we are used to getting government help when we have a problem, but you can’t call your senator to get you out of a crypto loss).\nFTX’s tweet response to CNBC guest Dan Wiener whining that he doesn’t need crypto because he’s not dealing drugs cements FTX’s position in the crypto-is-real world: They tweeted, “Do we really need free speech? I’m not a protestor, so I don’t need to worry about saying anything freely.”\nFTX leads in the crypto space — its newest service is a communication platform for token teams, which are investor groups offering or preparing to offer new token investments. Crypto experts who want to offer new token products will love FTX’s unique token team communication platform.\nThe Federal Reserve loosely defines the concept of a token as a term that can refer to a physical object, a digital object or computer code defined by a smart contract. Entrepreneurs in the token space can connect with team members and potential investors with FTX.\nAlthough in progress, FTX has not developed a desktop interface yet. Owners of several types of cryptocurrencies can use their phones, but sometimes that small screen isn’t adequate for crypto traders with expansive portfolios who need a decent-sized computer monitor. Desktop isn’t just for your parents — sometimes you need a big screen to see the big picture.\nFTX Services\nFTX (formerly Blockfolio) lets you trade and track your trades in one attractive, speedy app. Most users — and in Spring 2021, there are over 6 million — love FTX; those subscribers who don’t cite the irritating need to manually update prices. Lack of desktop and slow response time for problems are other service negatives.\nFTX Pricing\nNot only does FTX offer no-fee trading and no cost to use the tracker, but you also earn $10 in coin for every trade you make. The token team communication platform is also free.\nCustomer Service\nTo resolve problems, traders need to use FTX’s FAQ or send an email. Response times can be slower than you’d hoped for, but you’ll get an answer. Token teams rely on a discrete support department with swift service.\nFTX Mobile App\nFTX (formerly Blockfolio) is strictly mobile as of March 2021. The phone app use works great for IOS and Android. App fonts are easy to read on its dark background. With no desktop, you can see that FTX actively works to make its app as user-friendly as possible.\nFTX Overall Rating\nFTX (formerly Blockfolio) galloped out of the crypto tracker gate and is still kicking dirt on those in pursuit. When your money is on the line, you want to know that you can instantly see your holdings and their prices. FTX consistently delivers that reliability. If visual beauty stimulates you, you’ll love the FTX screen’s eye-saving darkness and readable font.\nFTX (Formerly Blockfolio) vs Competitors\nThe field of crypto tracking apps continues to grow. FTX is an established, long-term player in a game with sporadic dilettantes. A bonus is that the relative advent of trading in FTX in addition to tracking does not prevent users from importing data from any chosen exchanges. FTX’s token team communication platform lifts it above its competitors as the NFT market gains steam.\nFrequently Asked Questions",
    "nlp": [
        "launches",
        "ethereum",
        "support",
        "solana",
        "market",
        "nft",
        "ftx",
        "trade",
        "company",
        "nfts",
        "users",
        "mint",
        "way",
        "marketplace"
    ],
    "source_domain": "www.benzinga.com",
    "summary": "FTX US Launches NFT Market — Users Can Trade and Mint Solana NFTs, ETH Support on the WayOn Monday, FTX US announced the launch of its marketplace for non-fungible token (NFT) assets.\nFTX explained that the marketplace will feature Solana-based NFTs but support for Ethereum-based NFTs is coming in the near future.\nThe market will give FTX US users the ability to mint NFTs, as well as transfer the digital collectibles.\n“In the near future,” FTX NFTs plans to implement Ethereum support as well.\nImage Credits: Shutterstock, Pixabay, Wiki Commons, FTX NFTs Marketplace, Cyber Frogs NFT collection, Solagon NFT collection,Disclaimer: This article is for informational purposes only.",
    "text": null,
    "title": "FTX (Formerly Blockfolio) Review",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.benzinga.com/money/ftx-review/"
}