{
    "authors": [
        "Ibukun Ogundare",
        "Babafemi Adebajo",
        "Kseniia Klichova"
    ],
    "date_download": "2021-10-18 20:00:39",
    "date_modify": null,
    "date_publish": "2021-10-15 11:43:13",
    "description": "FTX joins hands with the International Cricket Council where the organization will be an official crypto partner for the upcoming ICC events.",
    "filename": "https%3A%2F%2Fwww.coinspeaker.com%2Fftx-association-cricket-council%2F.json",
    "image_url": "https://www.coinspeaker.com/wp-content/uploads/2021/10/ftx-international-cricket-foundation-420x280.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "FTX will be responsible for supporting all leading ICC events till 2023 beginning with the first match series that is scheduled to commence from October 17th.\nFTX Trading Limited has confirmed that it will be sponsoring the leading ICC (International Cricket Council) events starting from the Men 2020 World Cup which is scheduled to be organized in Oman and UAE. The collaboration will include all major ICC men and women World Cups followed by men and women’s T20 World Cups, Men’s Under 19 World Cup, and Men’s Cricket World Cup Qualifiers.\nFTX CEO Says He Is Looking Forward to Exploring This New “Unchartered” Territory\nFounder of FTX, Sam Bankman-Fried has commented that cricket is a sport that stretches back many decades and generations. He added that cryptocurrency although is still in its infancy but FTX is excited to have embarked upon this association where the exchange will get a chance to become an integral part of one of the most popular sports ever to be played globally. He further expressed his contentment with the said partnership and explained that he is looking forward to cultivating this agreement with ICC for years to come.\nThe Chief Commercial Officer of ICC, Anurag Dahiya has opined that he is excited to have FTX as one of the leading partners for ICC events. He further added that FTX has established itself as one of the leading organizations in the sector of cryptocurrency trading and their ambitious approach towards the crypto space will certainly complement the enthusiasm associated with the sport. Dahiya lauded the achievements of FTX in the domain of crypto trading and added that both organizations are working towards the same goal, which is to keep the audience engaged and updated with the new technological trends.\nFTX will be responsible for supporting all leading ICC events till 2023 beginning with the first match series that is scheduled to commence from October 17th. The organization has long been dabbling in the sports industry and has secured multiple deals in the said avenue that includes the Mercedes Formula One deal followed by another in association with Major League Baseball.\nFounded in 2019, FTX trading is one of the leading cryptocurrency exchanges that accommodates an average of $10 billion in trading volume daily (July 2021). The exchange at present hosts more than one million users and is currently valued at $18 billion. The organization is working towards expanding its service portfolio and is planning to introduce NFTs on the Ethereum blockchain sometime soon. FTX is also in process of launching Solana-based digital collectibles which can be accessed by consumers for minting, trading, and auctioning purposes.",
    "nlp": [
        "users",
        "launches",
        "ethereum",
        "nfts",
        "mint",
        "solana",
        "nft",
        "ftx",
        "trade",
        "company",
        "market",
        "way",
        "support",
        "marketplace"
    ],
    "source_domain": "www.coinspeaker.com",
    "summary": "FTX US Launches NFT Market — Users Can Trade and Mint Solana NFTs, ETH Support on the WayOn Monday, FTX US announced the launch of its marketplace for non-fungible token (NFT) assets.\nFTX explained that the marketplace will feature Solana-based NFTs but support for Ethereum-based NFTs is coming in the near future.\nThe market will give FTX US users the ability to mint NFTs, as well as transfer the digital collectibles.\n“In the near future,” FTX NFTs plans to implement Ethereum support as well.\nImage Credits: Shutterstock, Pixabay, Wiki Commons, FTX NFTs Marketplace, Cyber Frogs NFT collection, Solagon NFT collection,Disclaimer: This article is for informational purposes only.",
    "text": null,
    "title": "FTX Announces Global Association with International Cricket Council",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.coinspeaker.com/ftx-association-cricket-council/"
}