{
    "authors": [
        "Loves To Write",
        "Enthusiastic About Cryptocurrency. Currently Studying Physics At University."
    ],
    "date_download": "2021-10-18 20:00:19",
    "date_modify": null,
    "date_publish": null,
    "description": "On-chain data shows crypto exchange Coinbase saw a withdrawal of 400k Ethereum yesterday. This could be a sign of activity from institutional investors, and",
    "filename": "https%3A%2F%2Fwww.newsbtc.com%2Fnews%2Fethereum%2Fethereum-explode-400000-eth-coinbase%2F.json",
    "image_url": "https://www.newsbtc.com/wp-content/uploads/2021/10/drawkit-illustrations-8iIUDnRq87o-unsplash-860x484.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "On-chain data shows crypto exchange Coinbase saw a withdrawal of 400k Ethereum yesterday. This could be a sign of activity from institutional investors, and could prove to be bullish for the coin.\nCoinbase Observes Outflow Of 400,000 ETH\nAs pointed out by a CryptoQuant post, about 400k ETH (1.5 billion at the current exchange rate) was withdrawn yesterday from the crypto exchange Coinbase.\nThe indicator used here is the Ethereum outflow, which shows the total number of coins exiting wallets of the exchange.\nWhen the metric shows a big spike, it means a lot of ETH was withdrawn from the exchange. Investors usually take out a lot of coins to either hodl them or to sell them through OTC deals.\nSo, constant outflows can mean that there is a buying pressure in the market and investors feel bullish on Ethereum.\nNow, here is how the chart for the indicator looks like for the crypto exchange Coinbase:\nETH's outflow showed a large spike yesterday | Source: CryptoQaunt\nAs the above graph shows, the crypto exchange Coinbase saw a spike of a massive 400k Ethereum in outflows yesterday.\nOutflows this big can be a sign of activity from institutional investors as certainly normal holders won’t have these many coins to move around.\nRelated Reading | Only In Crypto: A Croissant Lists Potential Bullish Drivers For Bitcoin And Ethereum In Q4 2021\nInstitutional investors being bullish on ETH can mean huge things for the crypto. If ETH has to move to the next leg up, it will need a lot of money pumped into it, and this usually means whales like institutional investors need to get involved.\nAs these outflows already signal that institutional investors are taking their coins out of exchanges to perhaps hodl them, ETH’s outlook looks bullish.\nEthereum Price\nAt the time of writing, ETH’s price floats around $59.9k, up 9% in the last seven days. Over the last thirty days, the crypto has amassed 25% in gains.\nThe below chart shows the trend in the price of the coin over the last five days:\nETH's price makes a push up and approaches the $4k mark | Source: ETHUSD on TradingView\nETH has made a big push in the last few days as the coin now approaches a test of the $4k mark. It’s unclear at the moment if ETH can keep this momentum going and reach a new all time high (ATH) soon, or if it will falter once again.\nRelated Reading | TA: Ethereum Follows Bitcoin, Why ETH Could Surge Towards $4K\nIf the outflows are anything to go by, the general sentiment seems to be bullish and institutional investors getting involved can help with the big price pushes the crypto needs to break important resistance lines.\nFeatured image from Unsplash.com, charts from TradingView.com, CryptoQuant.com",
    "nlp": [
        "ethereum",
        "price",
        "coinbase",
        "400000",
        "investors",
        "exchange",
        "explode",
        "bullish",
        "set",
        "crypto",
        "institutional",
        "eth",
        "exits",
        "outflows",
        "looks",
        "shows"
    ],
    "source_domain": "www.newsbtc.com",
    "summary": "On-chain data shows crypto exchange Coinbase saw a withdrawal of 400k Ethereum yesterday.\nThis could be a sign of activity from institutional investors, and could prove to be bullish for the coin.\nCoinbase Observes Outflow Of 400,000 ETHAs pointed out by a CryptoQuant post, about 400k ETH (1.5 billion at the current exchange rate) was withdrawn yesterday from the crypto exchange Coinbase.\nSo, constant outflows can mean that there is a buying pressure in the market and investors feel bullish on Ethereum.\nAs these outflows already signal that institutional investors are taking their coins out of exchanges to perhaps hodl them, ETH’s outlook looks bullish.",
    "text": null,
    "title": "Ethereum Looks Set To Explode As 400,000 ETH Exits Coinbase",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-explode-400000-eth-coinbase/"
}