{
    "authors": [],
    "date_download": "2021-10-18 20:00:19",
    "date_modify": null,
    "date_publish": "2021-10-17 22:05:46",
    "description": "Top US crypto exchange Coinbase is adding two Ethereum (ETH) powered altcoins to its arsenal of tokens.",
    "filename": "https%3A%2F%2Fdailyhodl.com%2F2021%2F10%2F17%2Fcoinbase-adds-support-for-two-ethereum-based-altcoins-across-all-of-its-platforms%2F.json",
    "image_url": "https://dailyhodl.com/wp-content/uploads/2021/03/coinbase-bump.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Top US crypto giant Coinbase is adding two Ethereum (ETH) powered altcoins to its arsenal of tokens.\nAfter their initial launch on Coinbase Pro, BadgerDAO (BADGER) and Rarible (RARI) are now available to buy, sell, convert, store, send and receive on the company’s retail trading platform Coinbase.com and its iOS and Android applications.\nADVERTISEMENT\nBADGER is a decentralized autonomous organization (DAO) with the purpose of building infrastructure and products that help spur Bitcoin’s growth as a usable asset across other blockchains.\nAt time of writing its BADGER governance token is trading at $28.47, down by 7.5% on the day according to CoinGecko.\nRARI is the token that powers digital artist and creator community-owned non-fungible token (NFT) marketplace Rarible.\nRarible is a non-custodial platform, meaning users always have control over their tokens, which are not held by Rarible. So far, the Rarible marketplace only supports Ethereum-based cryptos.\nAt time of writing, RARI is trading at $23.49, down 4.6% on the day according to CoinGecko.\nBoth altcoins recently surged in price after they were added to Coinbase’s professional trading platform.\nDon't Miss a Beat – Subscribe to get crypto email alerts delivered directly to your inbox\nFollow us on Twitter, Facebook and Telegram\nSurf The Daily Hodl Mix\nADVERTISEMENT\nCheck Latest News Headlines\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\nFeatured Image: Shutterstuck/oneinchpunch/Vladimir Sazonov",
    "nlp": [
        "week",
        "coinbase",
        "clubhouse",
        "investors",
        "fund",
        "conflict",
        "competition",
        "classpass",
        "inevitable",
        "platform",
        "startups",
        "startup",
        "techcrunch",
        "studios",
        "south",
        "mindbody"
    ],
    "source_domain": "dailyhodl.com",
    "summary": "This week, cryptocurrency exchange platform Coinbase announced that it is launching its own NFT platform to take on OpenSea, an existing NFT platform.\nAs we discussed on Equity this week, the idea of having competitive companies within the same portfolio feels uncomfortable.\nBut, is it just me, or does competitive conflict sound somewhat inevitable?\nClassPass studios that are not using a booking software — Lanman says it’s about one-third of the studios on ClassPass — will now have the chance to sign up with Mindbody.\nTechCrunch Live is free for anyone who would like to attend live, so come hang every Wednesday at 3 p.m. EDT/noon PDT.",
    "text": null,
    "title": "Coinbase Adds Support for Two Ethereum-Based Altcoins Across All of Its Platforms",
    "title_page": null,
    "title_rss": null,
    "url": "https://dailyhodl.com/2021/10/17/coinbase-adds-support-for-two-ethereum-based-altcoins-across-all-of-its-platforms/"
}